package day04;

public class Ex05_Array {

	public static void main(String[] args) {
		/* 배열
		 * - 왜 사용?
		 *   - 여러 정보를 관리하는데 반복문을 이용할 수 있기 때문에
		 * - 언제 사용?
		 *   - 학생수, 나이, 태어난해 => 배열을 안씀
		 *   - 학생1의 국어성적, 학생2의 국어성적, 학생3의 국어성적 => 배열을 씀
		 *   - 학생1의 수학성적, 학생1의 국어성적, 학생1의 영어성적 => 배열을 안씀
		 *   - 같은 자료형이고 같은 의미를 가지는 정보를 관리할 때 사용
		 * - 배열 선언 방법 => 배열을 쓰겠다
		 *   - 자료형 [] 배열명;
		 *   - 자료형 배열명 [];
		 * - 배열 생성 방법 => 실제 배열을 만들어서 연결
		 *   - 배열명 = new 자료형[크기];
		 *   - 크기는 정수만 올수 있고, 변수, 상수, 리터럴 모두 올 수 있음
		 */

	}

}
